{
"start": {
		"text": "Your name is Joshua Mortin, and you are 36 years of age. You live in a world that\nis much like Earth, but it is a land ripe with magic, however the odds of a person\nbeing granted the ability to use magic is very small. You, unfortunately, have\nnot been born with the ability to use magic.",
		"choices": [
			{"text": "Continue", "next": "start1"},
			]
	},
	"start1": {
		"text": "You will go about your life over the next month and will be faced with decisions.\nYou must choose the correct path each time, or be faced with brutal consequences.\nIf, however, you choose the best scenario, you will be able to use magic!\nCan you make it to the end while having a low enough cost?",
		"choices": [
			{"text": "Accept the challenge", "next": "start2"},
			{"text": "I'm too weak and scared and petite for this...", "next": "start2-0"}
			]
	},
	"start2": {
		"text": "Let your journey.....................\nbegin...",
		"choices": [
			{"text": "Day 1", "next": "Day1-0"},
			]
	},
	"start2-0": {
		"text": "You thought you had a choice?\nIdiot.....",
		"choices":[{"text": "Day 1", "next": "Day1-0"}]
	},
	
	
	"Day1-0": {
		"text": "You are a farmer who lives alone in the land of Minia.\nIt is closing in on the end of harvesting season, and you need to purchase food and firewood\nwith the money you make this season to survive the winter.",
		"choices":[{"text": "Continue", "next": "Day1-1"}]
	},
	"Day1-1": {
			"text": "The closest town is a day’s journey--round trip, and you\nneed to sell before the end of the week, or the Woodcutter’s stores will run out.\nYou have had a bountiful harvest, generating more than enough food to survive the winter.\nIn a spur of the moment action, you come up with the idea to chop your own firewood.",
			"choices":[{"text": "Continue", "next": "Day1-2"}]
	},
	"Day1-2": {
			"text": "You are impressed with your amazing intellect and have made\nthe journey to the town. You are now choosing between purchasing an axe to chop your own\nfirewood, or purchasing firewood for a higher cost from the Woodcutter.",
			"choices":[{"text": "Continue", "next": "Day1-3"}]
	},
	"Day1-3": {
			"text": "Your current inventory: 300 food, 500 Minian Dollars.\nBoth choices give you enough firewood to get through the winter.\nAfter you make this decision the day is over, and you go home.",
			"choices":[{"text": "Purchase Axe for 50 Minian Dollars", "next": "Day2-0-c1"},
			{"text": "Purchase firewood for 150 Minian Dollars", "next": "Day2-0-c2"}]
	},
	"Day2-0-c1": {
			"text": "There are 10 days of winter in this world, and each day you consume 15 food.\nYour inventory is now 285 food and 450 Minian Dollars.\nThere is no time to waste, however, as you need to chop some firewood in order to stay warm.\nShould you fail to heat your home for a night, there is a 33% chance that you will freeze to death.\nEach night requires 20 wood.",
			"choices":[{"text": "Continue", "next": "Day2-0-c1-1"}]
	},
	"Day2-0-c1-1": {
			"text": "You awake bright and early, get dressed, pickup your axe, and head outside.\nYou spot a forest 30 minutes away, so you begin the trek over there.\nThis journey is extremely uneventful, but due to the small size of the forest,\nyou only gain 60 wood. It’s not nearly enough, and you are a bit worried.\nYou see another forest, and head over there, in hopes of more.",
			"choices":[{"text": "Continue", "next": "Day2-0-c1-2"}]
	},
	"Day2-0-c1-2": {
			"text": "You arrive at the forest and chop it down, gaining you 140 wood.\nThis is enough to survive the rest of winter, so you head home, but on the way\n you meet a traveler. This traveler tells you to, “Be wary of your journey home,”\nwhich send shivers down your spine.",
			"choices":[{"text": "Continue to next day", "next": "end_dummy"}]
	},
	"Day2-0-c2": {
			"text": "There are 10 days of winter in this world, and each day you consume\n15 food. Your inventory is now 285 food, 350 Minian Dollars, and 400 wood.\nShould you fail to heat your home for a night, there is a 33% chance that you will freeze to death.\nYou aren’t worried however, as you only use 20 wood per night, and have plenty wood leftover.",
			"choices":[{"text": "Continue", "next": "Day2-0-c2-1"}]
	},
	"Day2-0-c2-1": {
			"text": "You are sitting cozy in your house, sipping on some nice, warm tea that your neighbor,\nMary, gifted you free of charge after you helped her travel to and from\ntown a few weeks earlier. Speak of the devil, you hear the door knock\nand believe it to be Mary, as a female voice calls out, “Hello?”\nYou head to the door and open it, confused at the sight in front of you.",
			"choices":[{"text": "Continue", "next": "Day2-0-c2-2"}]
	},
	"Day2-0-c2-2": {
			"text": "There stands a female figure, who, upon laying her eyes on you, grabs a club and beats you over the head.\nYou fall to the floor and turn to run, but she hits you again,\nthis time in the leg. You wobble and fall again, but can’t use your leg, and turn to see it broken,\nwhich sends you spiraling into shock, losing consciousness.",
			"choices":[{"text": "Continue to next day", "next": "end_dummy"}]
	},
	
	"end_dummy": {
		"text": "Ending. (You should not be seeing this!)"
	}
}
